Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: སྡིག་པ་ ཐམས་ཅད་ བྱ་བ་ ལ་ འཛེམ་པ་ དང་ །_ འགྱོད་པ་ ཅན་ དུ་ འགྱུར །_
en: ensure that one refrains from negative acts; |#| ensure regret of wrongdoing;

source: དྲན་པ་ མི་ ཆོད་པ ར་ འགྱུར །_
en: ensure that one’s mindfulness is unbroken;

source: སྐྱེ་བ་ རྣམ་པར་ ལོག་པ ར་ འགྱུར །_།
en: ensure that birth is reversed;

source: དྲན་པ་ དང་ ལྡན་པ་ ཡང་ ཡིན་ ཏེ །_
en: and ensure that one will remain mindful. |#| $943 “Thus,

source: དྲན་པ འི་ སྟོབས་ མཆོག་ དང་ ལྡན་པ ས་ སྔོན་ གྱི་ སྨོན་ལམ་ ཡང་ མི་ གཏོང་བ ར་ འགྱུར །_
en: because one is very mindful, one’s past aspirations will not dissipate.

source: སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ལ་ དགེ་བ འི་ རྩ་བ་ བསྐྱེད་པ འི་ ཕྱིར་ བདག་ གི་ མེད་པ་ དང་ །_ ཡོངས་སུ་ འཛིན་པ་ མེད་པ འི་ སེམས་ ཀྱིས་ ཚོགས་ ཀྱི་ དགེ་བ འི་ རྩ་བ་ དཔག་ ཏུ་ མེད་པ་ ཡང་ སྐྱེད་པ ར་ འགྱུར །_
en: Because one produces roots of virtue in relation to the blessed buddhas, one will engender unfathomable accumulations of roots of virtue in a way that does not grasp and is free from a sense of ‘mine.’

source: སེམས་ཅན་ ཐམས་ཅད་ དང་ ཐུན་མོང་ དུ་ བྱེད་པ ར་ ཡང་ འགྱུར །_ |#| སེམས་ཅན་ དུ་ དམིགས་པ་ ལས་ རྣམ་པར་ དབེན་པ་ ལ་ ཡང་ མཁས་པ ར་ འགྱུར །_
en: Such stores will be shared with all beings, and yet one will be skilled in disengaging from observing any beings.

source: ཆོས་ རྣམས་ རྟོགས་པ ར་ ཁོང་ དུ་ ཆུད་པ ར་ ཡང་ འགྱུར་ ཞིང་ ཆོས་ ལ་ བརྟེན་པ་ མ་ཡིན་པ ར་ ཡང་ འགྱུར་ རོ །_།
en: One will achieve realization with respect to all phenomena, yet one will not take the support of any phenomenon.

source: དེ་ བརྟེན་པ་ ཡང་ མ་ཡིན་ པ ས་ བདུད་ དམ་ བདུད་ ཀྱི་ རིས་ ཀྱི་ ལྷ་ རྣམས་ སམ །_ དེ་ལས་ གཞན་པ འི་ སེམས་ཅན་ ལམ་ངན་ པར་ ཞུགས་པ་ རྣམས་ ཀྱིས་ ཐུལ་བ ར་ མི་ ནུས་ ཏེ །_
en: Since one takes no such support, one remains indomitable by māras, gods of the māra class, or any other being who has entered an unfortunate path.

source: བྱང་ཆུབ་ ཀྱི་ སྙིང་པོ་ དཔུང་གཉེན་ དུ་ ཡང་ འགྱུར་ རོ །_།
en: Instead one will become the guardian of the seat of awakening.

source: རང་ གི་ སྟན་ ལ་ འདུག་ སྟེ །_ |#| ཆོས་ ཐམས་ཅད་ ཤིན་ཏུ་ བྱང་བ་ དྲི་མ་ མེད་པ འི་ ཕྱག་རྒྱ འི་ ཏིང་ ངེ་ [116b] འཛིན་ ལ་ གནས་ ནས །_
en: $944 “Residing upon one’s seat one will enter the absorption of the stainless seal of mastery with regard to all phenomena. [116.b]

source: སྐད་ཅིག་ གཅིག་ དང་ ལྡན་པ འི་ ཤེས་རབ་ ཀྱིས་ གང་ ཆུང་ ཟད་ ཤེས་པ ར་ བྱ་བ་ དང་ །_ བལྟ་བ ར་ བྱ་བ་ དང་ །_ ཐོབ་པ ར་ བྱ་བ་ དང་ །_ མངོན་དུ་ བྱ་བ་ དེ་ ཐམས་ཅད་ ཀྱང་ མངོན་པར་ འདུ་བྱེད་ པར་ འགྱུར་ ཞིང་ །_
en: Thus, in a single instant of insight one will understand, view, attain, and actualize everything, down to the smallest object of knowledge.

source: མ་ལུས་པ ར་ མངོན་དུ་ བྱེད་ ལ །_
en: All will be actualized, and

source: ཐམས་ཅད་ མངོན་པར་ འཚང་རྒྱ་བ་ ཁོ་ན ར་ འགྱུར །_
en: one will understand everything.

source: ཐམས་ཅད་ མངོན་པར་ རྟོགས་པ་ ཁོ་ན ར་ འགྱུར །_ |#| ཐམས་ཅད་ ཡོངས་སུ་ ཤེས་པ་ ཁོ་ན ར་ འགྱུར་ ཞིང་ །_
en: There will be nothing but realization of everything, nothing but comprehension of everything, and

source: བག་ཆགས་ ཀྱི་ མཚམས་ སྦྱོར་བ་ མ་ལུས་པ་ ཉིད་ རྗེས་སུ་ འཐོབ་པ ར་ འགྱུར་བ་ སྟེ །_
en: all the linking of habitual tendencies will be attained without exception.#36

source: ཤ་ར་དྭ་ཏི འི་ བུ་ འདི་ ལ་ ཐེག་པ་ ཆེན་པོ་ ལ་ ཡང་དག་ པར་ ཞུགས་ པས་ གོ་ཆ་ ཆེན་པོ་ གྱོན་པ ར་ བྱེད་པ་ ཡིན །_
en: Śāradvatī­putra, one starts by donning the great armor of entering the Great Vehicle.

source: སེམས་ཅན་ འདི་དག་ ཐམས་ཅད་ ནི་ འདོད་ཆགས་ དང་ །_ ཞེ་སྡང་ དང་ །_ གཏི་མུག་ དག་ གིས་ ཡོངས་སུ་ གང་བ །_ སེམས་ཅན་ འདི་དག་ ཐམས་ཅད་ ནི་ མགོན་མེད་པ འི་ འཆི་བ་ ཉེ་བ ར་ གནས་པ་ མཐ ས་ ཟིན་པ འི་ འཆི་བ་ ཐོབ་པ །_ གཡང་ ས་ ཆེན་པོ ར་ ལྟུང་བ ར་ འགྱུར་བ །_ སེམས་ཅན་ འདི་དག་ ནི་ འཆི་བ་ ལ་ གསོ་བ་ རྙེད་ དཀའ་བ་ དང་ ལྡན་པ འོ་ སྙམ་ སྟེ
en: Thus, one thinks, ‘All these sentient beings are full of desire, anger, and bewilderment; |#| they are dying without a protector; |#| they are quickly approaching death; |#| they are falling from a great precipice; |#| they are gripped by death and can hardly be brought to life.’

source: ལྟ་བ་ ཆེན་པོ ས་ སེམས་ཅན་ ལ་ ལྟ་བ འི་ གོ་ཆ་ གྱོན་པ ར་ བྱེད་པ་ ཡིན །_
en: Thinking in this way, one dons the armor of seeing sentient beings by means of the great view.

source: སེམས་ཅན་ དེ་དག་ ལ་ བདག་ གིས་ ཁམས་ གསུམ་པ་ ལས་ ངེས་པ ར་ འབྱུང་བ འི་ ཐེག་པ་ ཆེན་པོ་ དེ་ཡང་ དག་ པ ར་ བསྒྲུབས་ ནས་ བསྟན་པ ར་ བྱ འོ །_།
en: $946 “Thus, one pledges to accomplish the Great Vehicle that frees from the three realms so that one can teach it to sentient beings.

source: སེམས་ཅན་ ཐམས་ཅད་ གསོ་བ ར་ དགོས་པ འི་ ཕྱིར་ ཡོངས་སུ་ མ་ བཙལ་ ཅིང་ གསོལ་བ་ མ་ བཏབ་པ ར་ བདག་ཅག་ གིས་ བལྟ་བ ར་ བྱ་ དགོས་ སོ །_།
en: Understanding that sentient beings must be healed, one pledges to care for them, even when not being entreated or asked to do so.

source: ཇི་ལྟ ར་ སེམས་ཅན་ རྣམས་ ཀྱིས་ གཟུགས་ ཀྱི་ ཆོས་ཉིད་ མི་ གཡོས་པ་ རྗེས་སུ་ ཐོབ་པ ར་ འགྱུར་བ་ དང་ །_ ཚོར་བ་ དང་ །_ འདུ་ཤེས་ དང་ །_ འདུ་བྱེད་ དང་ །_ རྣམ་པར་ ཤེས་པ འི་ ཆོས་ཉིད་ མི་ གཡོས་པ་ རྗེས་སུ་ ཐོབ་པ ར་ འགྱུར་བ་ དང་ །_ མྱ་ངན་ ལས་ འདས་པ ར་ འགྲོ་བ འི་ ལམ་ མི་ གཡོས་པ་ རྗེས་སུ་ ཐོབ་པ ར་ འགྱུར་བ་ དེ་ལྟ་ བུ འི་ གསོ་བ ས་ བདག་ཅག་ གིས་ སྦྱོར་བ ར་ བྱ འོ་ སྙམ་ དུ་ དེ་དེ་ ལྟར་ སེམས་ ཤིང་ གོ་ཆ་ བགོས་ ནས་ |#| ཆོས་ ཚོལ་བ་ ལ་ མངོན་པར་ བརྩོན་པ་ ཡིན་ ཏེ
en: ‘I shall nurture all beings by helping them attain the immutable nature of form, feeling, perception, formation, and consciousness, as well as the immutable nature of the path that transcends suffering.’ |#| Thinking in this way, one dons the armor and persists in the pursuit of Dharma.

source: ཆོས་ གང་དག་ ཚོལ་ བར་ བྱེད་ ཅེ་ན །_
en: $947 “Which Dharma does one then pursue?

source: དེ་དག་ ནི་ བྱང་ཆུབ་ ཀྱི་ ཕྱོགས་ ཀྱི་ ཆོས་ ཡོངས་སུ་ སྨིན་པ ར་ འགྱུར་བ་ དང་ །_ སངས་རྒྱས་ ཀྱི་ ཆོས་ རྣམས་ ཡོངས་སུ་ སྨིན་པ ར་ འགྱུར་བ་ སྟེ །_
en: The maturation of the factors of awakening and the qualities of buddhahood. [117.a]

source: འདི་ལྟ་སྟེ །_ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཐེ་ཚོམ་ [117a] གཅོད་པ ར་ བྱེད་པ །_ སེམས་ཅན་ ཐམས་ཅད་ ཡང་དག་ པར་ ཚིམ་པ ར་ བྱེད་པ འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ གཟུང་བ་ དང་ །_ དབང་པོ་ ཤིན་ཏུ་ རྒྱས་པ ར་ མངོན་པར་ བསྒྲུབ་པ་ ཡང་དག་ པར་ སྒྲུབ་པ འི་ ཕྱིར །_ ཆོས་ དེ་དག་ ཡོངས་སུ་ ཚོལ་ བར་ བྱེད་ དེ
en: That is to say, one pursues the Dharma in order to apprehend those Dharma teachings that eliminate the doubts of all beings and satisfy them, and in order to accomplish the fully developed faculties.

source: དེ་ལྟ ར་ ཆོས་ ཡོངས་སུ་ ཚོལ་བ་ ལ་ མངོན་པར་ བརྩོན་པ ས་ གནས་པ་ ཡིན་ ཏེ །_
en: $948 “As one diligently pursues the Dharma,

source: ཐ་ན་ སངས་རྒྱས་ ཀྱི་ མཚན་ དང་ ལྡན་པ འི་ ཚིགས་ སུ་ བཅད་པ་ ཟབ་མོ་ དང་ ལྡན་པ །_ ཐབས་ ལ་ མཁས་པ་ དང་ །_ དོན་ ཟབ་མོ་ དང་ ལྡན་པ འི་ ཚིག་ བཞི་པ འི་ ཚིགས་ སུ་ བཅད་པ་ གཅིག་ ཙམ་ ལུས་ ལ་ ཐོགས་ ཏེ
en: one should, at a minimum, carry upon one’s body a profound verse that includes the name of a buddha. |#| Even if one carries just such a single four-lined skillful and profound verse,

source: སེམས་ཅན་ གཅིག་ ཙམ་ ལ་ ཡང་ཡང་ དག་པ ར་ རབ་ཏུ་ སྟོན་པ ར་ བྱེད་པ་ ཡིན །_
en: one must also teach it to others, even if it is just to one single person.

source: ཆོས་ དེ འི་ དོན་ དང་ །_ ཚིགས་ སུ་ བཅད་པ་ དེ འི་ དོན་ གང་ཡིན་པ་ དེ་ སེམས་ཅན་ དེ་ དང་སེམས་ ཅན་ ཐམས་ཅད་ ཀྱིས་ ཀུན་ཤེས་ པར་ གྱུར་ཅིག་ ཅེས་ དེ་ལྟ་ བུ འི་ སྨོན་ལམ་ འདེབས་པ ར་ བྱེད་པ་ ཡིན་ ནོ །_།
en: And when one teaches it, one should pray, ‘May all beings comprehend the meaning of this teaching and the meaning of this verse.’

source: དེ་ དགེ་བ འི་ རྩ་བ་ དེས་ མཆོག་ གཙོ་བོ་ རབ་མཆོག _། གྱ་ནོམ་པ །_ སངས་རྒྱས་ ཀྱིས་ རྗེས་སུ་ གནང་ ཞིང་ འཕགས་པ ས་ རྗེས་སུ་ གནང་ ལ །_ མཁས་པ ས་ བསྟོད་ ཅིང་ མཛངས་པ ས་ མ་སྨད་པ འི་ ཆོས་ བཞི་ རྗེས་སུ་ ཐོབ་པ ར་ འགྱུར་ ཏེ
en: $949 “By the power of the associated roots of virtue, four things ensue that are supreme, paramount, and consummate. |#| They are granted by the buddhas and by noble beings, praised by the learned, and beyond reproach from the wise.

source: དྲན་པ་ བཅད་ དུ་ མེད་པ་ ཡིན །_
en: Undivided mindfulness;

source: སངས་རྒྱས་ ཀྱི་ ཆོས་ རྣམས་ ལ་ དྲན་པ་ དེས་པ་ ཡིན །_
en: certain recollection of the qualities of the buddhas;

source: བདག་ཉིད་ ཀྱིས་ ཀྱང་ ཆོས་ ཀྱི་ སྣོད་ དུ་ བྱེད་པ་ ཡིན །_
en: becoming a proper vessel of the Dharma;

source: སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ རྟེན་ དུ་ གྱུར་པ་ ཡང་ ཡིན་ ཏེ །_
en: and becoming a support for the blessed buddhas.

source: དེ་ ལ་ བརྟེན་ ནས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཆོས་སྟོན་ པར་ མཛད་ དོ །_།
en: Based on those, the thus-gone ones, the worthy ones, the perfect buddhas will teach the Dharma.

source: ཆོས་ གཉིས་པ་ འདི་ ཡང་ རྗེས་སུ་ ཐོབ་པ ར་ འགྱུར་ ཏེ །_
en: From the attainment of the second of these qualities,

source: གཟུངས་ཐོབ་པ་ རྗེས་སུ་ ཐོབ་པ ར་ འགྱུར་བ་ ཡིན །_
en: the attainment of retention will follow.

source: སྐྱེ་བ་ རྣམ་པར་ ལོག་ ནས་ ཀྱང་ སངས་རྒྱས་ ཀྱི་ བྱང་ཆུབ་ ཐམས་ཅད་ རྗེས་སུ་ ཐོབ་པ ར་ འགྱུར་བ་ ཡིན །_
en: As one reverses the process of taking birth, one will reach the full attainment of the buddhas’ awakening.

source: ལྟ་བ་ སྡིག་པ་ ཅན་ མ་ཡིན་པ འི་ ཁྱིམ་ དག་ ཏུ་ ཡང་ སྐྱེ་བ ར་ འགྱུར་བ་ ཡིན །_
en: One will be born into a family of people who do not have an evil view,

source: སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ བསྟན་པ་ ལ་ ཡང་ མངོན་པར་ འབྱུང་བ་ ལ་ ཡིད་ གཞོལ་བ་ ཡིན །_
en: one will go forth in and follow the teachings of the blessed buddhas, and

source: འདོད་པ འི་ ཡོན་ཏན་ ལྔ་པོ་ དག་ ཀྱང་ སྤོང་བ་ ཡིན་ ནོ །_།
en: one will relinquish the five sense pleasures.

source: ཆོས་ བཞི་པོ་ འདི་ ཡང་ རྗེས་སུ་ ཐོབ་པ ར་ འགྱུར་ ཏེ །_
en: $950 “From the attainment of these four qualities,

source: དེ་ དགེ་བ འི་ རྩ་བ་ དེས་ ཆོས་ བཅུ་ རྗེས་སུ་ ཐོབ་པ ར་ འགྱུར་ རོ །_།
en: the associated roots of virtue will also bring forth a set of ten qualities. [117.b]

source: བཅུ་ གང་ [117b] ཞེ་ན །_
en: What are those ten?

source: འདི་ལྟ་སྟེ །_ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཐེ་ཙོམ་ གཅོད་པ ར་ བྱེད་པ་ རྗེས་སུ་ ཐོབ་པ ར་ འགྱུར་བ་ ཡིན །_
en: They are the accomplishment of eliminating the doubts of all sentient beings;

source: སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ རྟེན་ བསྒྲུབ་པ་ རྗེས་སུ་ ཐོབ་པ ར་ འགྱུར་བ་ ཡིན །_
en: the attainment of the support for all sentient beings;

source: སངས་རྒྱས་ ཀྱི་ རྣམ་པར་ ཐར་པ་ སྒྲིབ་པ་ མེད་པ་ ཡང་ རྗེས་སུ་ ཐོབ་པ ར་ འགྱུར་བ་ ཡིན །_
en: the attainment of the buddhas’ liberation free of obscuration;

source: རྣམ་པར་ ཐར་ པ འི་ སྒོ་ དེས་ དེ་བཞིན་ གཤེགས་པ་ རྗེས་སུ་ ཐོབ་ ནས་ སྤུ འི་ ཁུང་བུ་ རེ་རེ་ ལས་ འོད་ཟེར་ བྱེ་བ་ ཁྲག་ཁྲིག་ ཕྲག་ འབུམ་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འགྱེད་པ་ ཡིན །_
en: achieving the stage of a thus-gone one through the gateways of liberation ; |#| shining forth billions of light rays, beyond number and count, from each single hair follicle on one’s body;

source: འོད་ཟེར་ རེ་རེ ས་ ཀྱང་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འབུམ་ དག་སྣང་ བར་ བྱེད་པ་ ཡིན །_
en: illuminating hundreds of thousands of buddha realms with every single light ray;

source: འོད་ཟེར་ དེ་ ལ་ ཡང་ པད་མ་ འབུམ་ དག་ མངོན་པར་ སྤྲུལ་པ ར་ བྱེད་པ་ ཡིན །_
en: emanating hundreds of thousands of lotuses with each single light ray;

source: པད་མ་ ཐམས་ཅད་ ལ་ ཡང་ དེ་བཞིན་ གཤེགས་པ འི་ སྐུ་ སྤྲུལ་པ ར་ བྱེད་པ་ ཡིན །_
en: emanating the body of a thus-gone one from each of those lotuses;

source: དེ་བཞིན་ གཤེགས་པ་ རེ་རེ ས་ ཀྱང་ ཆོས་ བསྟན་པ་ རེ་རེ ས་ སེམས་ཅན་ བྱེ་བ་ ཁྲག་ཁྲིག་ ཕྲག་ འབུམ་ དག་ ཡོངས་སུ་ སྨིན་པ ར་ བྱེད་ དེ །_
en: letting each of those thus-gone ones ripen trillions of beings through teaching the Dharma,

source: ཇི་ལྟ ར་ གཟུགས་ ཀྱི་ ཆོས་ཉིད་ མི་ གཡོས་ པ་ རྗེས་སུ་ ཐོབ་པ ར་ འགྱུར་བ་ དེ་ལྟ་ བུས་ ཀྱང་ ཡོངས་སུ་ སྨིན་པ ར་ བྱེད་པ་ ཡིན །_
en: thus ripening them in accord with the attainment of the immutable intrinsic nature of form;

source: སྒྲིབ་པ་ མེད་པ་ ཕུན་སུམ་ ཚོགས་པ་ དེ་ དང་ ལྡན་པ་ སྤུ་ གསེབ་ རེ་རེ་ ལས་ མེ འི་ ཕུང་པོ་ ལྷུན་པོ་ ཇི་སྙེད་ འབར་བ ར་ བྱེད་པ་ ཡིན་ སྤུ འི་ ཆ་ དེ་ཉིད་ ལས་ ཀྱང་ ཆུ འི་ རྒྱུན་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ རབ་ཏུ་ འབབ་པ ར་ བྱེད་པ་ ཡིན་ ཏེ
en: and employing such freedom from obscuration to the effect that mountains of fire can blaze forth from each body hair, and rivers equal to the amount of sand grains in the river Ganges can gush forth from the very same body hairs,

source: སྒྲིབ་པ་ མེད་པ འི་ རྣམ་པར་ ཐར་པ་ ཕུན་སུམ་ ཚོགས་པ་ དེ་ དང་ ལྡན་པ ས་ ཀྱང་ །_ དེ་བཞིན་ གཤེགས་པ ས་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྤུ་ གཅིག་ གི་ རྩེ་མོ ས་ ཕུག་ སྟེ །_ |#| འཇིག་རྟེན་ གྱི་ ཁམས་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ དུ་ འཕངས་ ཤིང་ །_ དེ་བ ས་ ཀྱང་ ལྷག་པ ར་ འཕངས་ ཀྱང་ སེམས་ ཅན་ དེ་དག་ འདི་ སྙམ་ དུ་ བདག་ཅག་ འཇིག་རྟེན་ གྱི་ ཁམས་ གཞན་ དུ་ ཁྲིད་ དོ་ ཀུན་ ཏུ་ ཁྲིད་ དོ་ སྙམ་ དུ་ མི་ སེམས་ སོ །_།
en: all the while employing such perfect freedom without obscuration to the effect that the thus-gone ones may penetrate an entire trichiliocosm with the tip of a hair and hurl that entire universe away, beyond more universes than there are grains of sand in the river Ganges, without any of the sentient beings living there getting the sense that their world has been transferred.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ སྒྲིབ་པ་ མེད་པ འི་ རྣམ་པར་ ཐར་པ་ ཕུན་སུམ་ ཚོགས་པ་ དེ་ དང་ ལྡན་པ ས །_ དེ་བཞིན་ གཤེགས་པ ས་ ཕྱོགས་ ཐམས་ཅད་ ཀྱི་ ངེས་པ འི་ ཚིག་ དག་ རབ་ཏུ་ ཤེས་ སོ །_།
en: $951 “Śāradvatī­putra, endowed with such unobscured and perfect freedom, the thus-gone ones are aware of everything that is said throughout all directions.

source: སེམས་ ཅན་ ཐམས་ཅད་ ཀྱི་ སེམས་ ཀྱི་ རྒྱུད་ ལོ་ བྱེ་བ་ ཕྲག་ འབུམ་ ནས་ སྐྱེས་པ་ དང་ འགགས་པ་ དག་ རབ་ཏུ་ ཤེས་ སོ །_།
en: They are aware of all that has transpired within the minds of all beings throughout a trillion years.

source: སེམས་ཅན་ ལོ་ བྱེ་བ་ ཕྲག་ འབུམ་ དུ་ སྐྱེས་པ་ རྣམས་ ཀྱིས་ ཆོས་ ཀྱི་ ཐེ་ཚོམ་ དག་ སོ་སོ ར་ སེལ་བར་ བྱེད་ དོ །_།
en: They dispel each of the doubts regarding the Dharma that may have arisen within sentient beings throughout a trillion years.

source: དེ་བཞིན་ གཤེགས་པ་ འབྱུང་བ ར་ མི་འགྱུར་བ་ དང་ །_ ཆོས་ གནས་པ ར་ མི་ འགྱུར་ [118a] བ་ དེར་ ཡང་ རྣམ་པར་ ཐར་པ་ ཕུན་སུམ་ ཚོགས་པ་ དེ་ དང་ ལྡན་པ ས །_ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ སེམས་ ཚར་ བཅད་པ་ ཡང་ རབ་ཏུ་ ཤེས་ སོ །_། |#| སེམས་ རབ་ཏུ་ འཛིན་པ་ ཡང་ རབ་ཏུ་ ཤེས་ སོ །_། |#| སེམས་ ཀྱི་ མཚམས་ སྦྱོར་བ་ དང་ །_ སེམས་ ཀྱི་ རྒྱུ་བ་ ཡང་ རབ་ཏུ་ ཤེས་ སོ །_།
en: Where no thus-gone one has appeared and no Dharma remains [118.a] their perfect freedom enables them to know when the minds of sentient beings are destroyed, upheld, connected, or in movement.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ལྟ ར་ སྒྲིབ་པ་ མེད་པ འི་ རྣམ་པར་ ཐར་པ་ བརྙེས་པ འི་ དེ་བཞིན་ གཤེགས་པ་ ནི་ ཆོས་ ཐམས་ཅད་ ལ་སོ་ སོར་ སྒྲིབ་པ འི་ གནས་ རབ་ཏུ་ ཤེས་ སོ །_།
en: $952 “Śāradvatī­putra, thus-gone ones who have gained this perfect freedom without any obscuration are aware of the factors that individually obscure all phenomena.

source: གཅིག་ ཏུ་ མཐར་ཐུག་པ་ ཆད་པ་ དེ་ དང་ །_ དངོས་པོ་ ཐམས་ཅད་ ཀྱི་ སྟོང་པ་ དངོས་པོ་ མེད་པར་ ཤེས་པ་ དེ་ དང་ །_ ཡོངས་སུ་ འཛིན་ པ་ ཐམས་ཅད་ ལ་ བདག་ གི་བ འི་ འདུ་ཤེས་ མི་ སྐྱེད་ དོ །_།
en: The fact that they alone have penetrated the ultimate, that they know the emptiness of all entities to be itself without entity, or that they care for all gives rise to no self-oriented perception.

source: ཆོས་ གཅིག་ ངེས་པ ར་ བསམས་ ན་ མཛའ་བཤེས་ རབ་ཏུ་ ཤེས་པ་ མ་གཏོགས་ པར་ མཛའ་བཤེས་ ཐམས་ཅད་ ལ་ བདག་ གི་བ འི་ འདུ་ཤེས་ ཅན་ མ་ ཡིན་ ནོ །_།
en: They recognize as close to them those who think only of the Dharma, but with that exception they have no self-oriented perception of any close ones at all.

source: ཆོས་མ་ ཡིན་པ་ སྤྱོད་པ་ ལ་ མཛའ་བཤེས་ མ་ཡིན་པ ར་ ཤེས་ ནས །_
en: Recognizing as not close to them those who engage in what is not the Dharma,

source: འདུས་བྱས་ ཐམས་ཅད་ ཀྱི་ གནས་ ལ་ ཡོན་ཏན་ གྱི་ གནས་ གཅིག་ ཀྱང་ མ་ མཐོང་ ངོ་ །_།
en: they see not even a single good quality within the entirety of conditioned things.

source: འདུས་བྱས་ ཐམས་ཅད་ ལ་ ཡོན་ཏན་ མེད་པ་ དང་ །_ སྐྱོན་ དང་ བཅས་པ ར་ ཤེས་ ནས་
en: They know all conditioned things to be devoid of good qualities and full of flaws.

source: ཆོས་ དེ་ འདྲ་བ་ དེ་དག་ རྗེས་སུ་ ཐོབ་པ ར་ འགྱུར་ རོ །_།
en: Such are the qualities that they attain.

source: གཞན་ ཡང་ ཆོས་ བཞི་ རྗེས་སུ་ ཐོབ་པ ར་ འགྱུར་ ཏེ །_
en: $953 “They also obtain another set of four qualities.

source: བག་ཆགས་ ཀྱི་ མཚམས་ སྦྱོར་བ་ རྒྱུན་ ཆད་པ ར་ རྗེས་སུ་ ཐོབ་པ་ ཡིན །_
en: The thus-gone ones are able to interrupt the continuity of habitual tendencies.

source: ལམ་ དུ་ འགྲོ་བ་ ན་ ཡང་ སེམས་ཅན་ གང་དག་ གིས་ དེ་བཞིན་ གཤེགས་པ འི་ ཞབས་ དག་ ལ་ རེག་པ་ དེ་དག་ ཐམས་ཅད་ བདེ་བ་ ཐམས་ཅད་ ལ་ ཡང་དག་ པར་ གཏད་པ ར་ འགྱུར་བ་ ཡིན །_
en: When they walk along a path, all the living creatures that are touched by the thus-gone ones’ feet will be guided toward happy states.

source: དེ་བཞིན་ གཤེགས་པ ས་ འཁོར་ལོ འི་ ཚད་ ཙམ་ ལ་ གཟིགས་ ན་ ཡང་ དེ་ ལྷོ་ནུབ་ ཀྱི་ ཕྱོགས་མཚམས་ ནས་ དཔག་ཚད་ དྲུག་ཅུ་ རྩ་ གཉིས་ སུ་ ས་ ཡོངས་སུ་ གཡོས་པ ར་ འགྱུར་ རོ །_།
en: A thus-gone one need glance no more than a wheel’s width ahead for the whole earth within sixty-two leagues to the southwest to start moving.#37

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ ལ་ ནི་ གང་ མཉམ་པ ར་ མ་ བཞག་པ ར་ འགྱུར་བ འི་ ཐུགས་ འགའ་ཡང་ མི་ མངའ་ སྟེ །_
en: Śāradvatī­putra, the thus-gone ones never have their minds not in equipoise;

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ རྟག་ ཏུ་ མཉམ་པ ར་ བཞག་པ་ ཡིན་ ནོ །_།
en: Śāradvatī­putra, the thus-gone ones are always in equipoise.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ ལ་ ནི་ ཏིང་ངེ་འཛིན་ ལས་ ཉམས་པ འམ །_ ཏིང་ངེ་འཛིན་ ལས་ གཡོ་བ་ མི་ མངའ་ སྟེ །_
en: Śāradvatī­putra, the thus-gone ones know no diminishing of their absorption; |#| they know no departure from their absorption.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ མདོར་ན་ སངས་རྒྱས་ ཀྱི་ ཆོས་ ཐམས་ཅད་ ནི་ ཆོས་ ཡོངས་སུ་ ཚོལ་བ་ ལ་ རག་ ལས་ [118b] པ་ ཡིན་ ནོ །_།
en: $954 “In short, Śāradvatī­putra, all the qualities of the thus-gone ones depend on the pursuit of the Dharma.” [118.b]

source: གང་ གི་ དོན་ དུ་ ཐེག་པ་ ཡིས །_། སེམས་ཅན་ རྣམས་ ལ འང་ སྙིང་རྗེ་ ཉིད །_། ཆོས་ ལ་ གུས་ དང་ བཅས་པ་ ཡིས །_། ཡེ་ཤེས་ དེ་ ཡི་ ཕ་རོལ་ འགྲོ །_།
en: “Through having compassion for all beings As well as respect for the Dharma, One will reach the other shore of wisdom In the vehicle intended for that goal.

source: སེམས་ཅན་ རྣམས་ ཀྱི་ སེམས་ ཤེས་ དང་ །_། འཇིག་རྟེན་ གསུམ་ དུ་ མི་ གཡོས་པ འི །_། རྫུ་འཕྲུལ་ རྟོག་པ ར་ གང་ འདོད་པ ས །_། ཆོས་ ལ་ གུས་ དང་ བཅས་པ ར་ བྱ །_།
en: $956 “Those who wish to understand the minds of beings And realize supernatural powers That are unwavering throughout the three worlds Should have respect for the Dharma.

source: !ཆོས་ ལ་ གུས་ དང་ བཅས་ བྱས་ ནས །_།
en: $957 “If#38 they have respect for the Dharma,

source: རྟག་ ཏུ་ མཆོད་འོས་ ཉིད་ དུ་ འགྱུར །_།
en: They will always be worthy of reverence;

source: སངས་རྒྱས་ ཆོས་ རྣམས་ མཐའ་ཡས་པ འི །_། ཆོས་མཆོག་ ལ་ ཡང་ རེག་པ ར་ འགྱུར །_།
en: They will connect with the most supreme Dharma Among the infinite qualities of the buddhas.

source: !ཆོས་ ལ་ གུས་པ ར་ བྱས་ ནས་ ནི །_། དེ་ ཡི་ དྲན་པ་ ཉམས་ མི་ འགྱུར །_།
en: $958 “If#39 they have respect for the Dharma, Their mindfulness will not diminish,

source: སྐྱེ་བ་ དེ་ དང་ དེ་ ཀུན་ དུ །_། དེ་ ཡི་ དྲན་པ་ རབ་ཏུ་ འཕེལ །_།
en: But develop exponentially Over each and every lifetime.

source: ཆོས་ དེ་ ལ་ ནི་གུ ས་ བྱས་ ན །_།
en: $959 “If they have respect for the Dharma,

source: གཟུགས་ ལས་ ཉམས་པ ར་ མི་ འགྱུར་ ཏེ །_།
en: They will not decline in beauty, But

source: ཡན་ལག་ ཉིང་ལག་ མཛེས་པ་ དང་ །_། རྟག་ ཏུ་ ཚུལ་ དུ་ ཤིས་པ ར་ འགྱུར །_།
en: all the main and minor parts of their body Will be exquisite, always pleasing.

source: རྟག་པ ར་ འདྲེན་ རྣམས་ མཉེས་ བྱེད་ ཅིང་ །_། མཐོང་ ན་ |#| དེ་ ལ་ དད་ བྱེད་ ལ །_།
en: $960 “They will always delight the guides And be inspired when beholding them.

source: སེམས་ ཀྱི་ འདུ་བྱེད་ དད་པ་ ཡིས །_། འཇིག་རྟེན་ འདྲེན་ རྣམས་ མཆོད་ བྱེད་པ །_།
en: With a devout frame of mind, They will revere the guides of the world,

source: སྐྱེ་བ་ དེ་ དང་ དེ་ ཀུན་ དུ །_། དེ་ ཡི་ དད་པ་ རབ་ཏུ་ འཕེལ །_།
en: $961 “And their faith will grow exponentially, Over each and every lifetime.

source: འདོད་པ་ ངན་པ་ རྟེན་ མི་ བྱེད །_། |#| སྤངས་ ནས་ མྱུར་ དུ་ རབ་ཏུ་ འབྱུང་ །_།
en: They will not indulge in negative desires, But abandon them and promptly go forth.

source: རྟག་ ཏུ་ ཚུལ་ཁྲིམས་ ཕུང་པོ་ ལ འང་ །_། མཁས་པ་ རབ་ཏུ་ གནས་པ ར་ འགྱུར །_། |#| ཚུལ་ཁྲིམས་ ཀྱིས་ ཀྱང་ རློམ་སེམས་ མེད །_།
en: $962 “They will also be skilled in perpetually observing The collection of ethical precepts, But without conceit in their ethical discipline.

source: དེ་ ལ་ ཏིང་འཛིན་ ཚོལ་ བར་ བྱེད །_།
en: They will pursue meditative absorption,

source: རྟག་ ཏུ་ མཉམ་པ ར་ བཞག་པ ར་ འགྱུར །_། |#| ཏིང་ངེ་འཛིན་ ལ འང་ རློམ་སེམས་ མེད །_།
en: $963 “And always remain in equanimity, But without conceit in their meditative absorption.

source: འཇིག་རྟེན་ ཀུན་ གྱི་ མཆོག་ གང་ཡིན །_། |#| ཤེས་རབ་ ལ་ ཡང་ཕྱི ར་ ཞིང་ སྟེན །_།
en: They will rely even more on insight, Which is supreme throughout all worlds.

source: རྟག་ ཏུའང་ ཡེ་ཤེས་ ལྡན་པ ར་ འགྱུར །_། |#| ཡེ་ཤེས་ ཀྱིས་ ཀྱང་ རློམ་སེམས་ མེད །_།
en: $964 “They will become ever endowed with wisdom, But without conceit in it.

source: ཡེ་ཤེས་ དེ་ ཡིས་ མི་ རློམ་ ཞིང་ །_། དེ་ ནི་ སངས་རྒྱས་ ཆོས་ རྣམས་ ཚོལ །_།
en: Without being conceited about that wisdom, They will pursue the Dharma of the buddhas.

source: སངས་རྒྱས་ ཀྱིས་ ནི་ བསྔགས་པ འི་ གཟུངས །_། ཆོས་ ཀྱི་ སྣང་བ་ ཐོབ་པ ར་ འགྱུར །_།
en: $965 “They will obtain the light of the Dharma, The power of retention so praised by the buddhas.

source: ཆོས་ ཀྱི་ སྣོད་ དུ་ མཁྱེན་ ནས་ ཀྱང་ །_། སྟོན་པ ས་ དེ་ ལ་ བྱིན་ རློབ་ མཛད །_།
en: The teacher, understanding them as vessels for the Dharma, Will authorize them.

source: ཆོས་ སྨྲ་ དེ་ ནི་ བྱིན་ བརླབས་ འགྱུར །_། |#| སྲོག་ཆགས་ ཕན་ ཕྱིར་ ཆོས་སྟོན་ ཅིང་ །_།
en: $966 “Thus authorized to preach the Dharma, They will teach the Dharma to benefit living beings.

source: ཐོགས་མེད་ ཚིག་ དང་ སྤོབས་ ལྡན་ ཏེ །_། |#| སོ་སོ་ རིག་ ཐོབ་ མཐུ་ཆེན་ འགྱུར །_།
en: With unobstructed expression and eloquence, They will attain discernment and become powerful. [119.a]

source: [119a] ཐོག་མ འི་ དུས་ དང་བ ར་ དུས་ དང་ །_། ཐ་མ འི་ དུས་ སུ་ ཆོས་ འཛིན་ འགྱུར །_།
en: $967 “They will become experts in the Dharma, At its beginning, middle, and end.

source: ཀུན་ དུ་ རྟག་པ ར་ སངས་རྒྱས་ བསྔགས །_། |#| མི་ རྣམས་ ཀྱི་ ནི་ དོན་ ཆེན་ བྱེད །_།
en: They will perpetually be praised by the buddhas, And act for the great benefit of humanity.

source: དེ་བཞིན་ ལྷ་ རྣམས་ བསྔགས་པ་ བརྗོད །_། |#| གནོད་སྦྱིན་ ཀླུ་ ཡིས་ དེ་ མཆོད་ འགྱུར །_།
en: $968 “They will likewise be praised by the gods, And revered by yakṣas and nāgas.

source: སངས་རྒྱས་ རྣམས་ ཀྱིས་ རྟག་ བསྔགས་ འགྱུར །_། |#| ཕྱོགས་ བཅུ ར་ དེ་ ཡི་ གྲགས་པ་ འབྱུང་ །_།
en: With the buddhas’ constant praise, Their reputation will spread throughout the ten directions.

source: ཆོས་ ལ་ སྤྱོད་པ་ མ་སྨད་པ །_། དེ་ ཡི་ སྙན་གྲགས་ ཉམས་ མི་ འགྱུར །_།
en: $969 “Without shirking their practice of the Dharma, Their renown will not diminish.

source: ཆོས་ མིན་ནམ་ ཡང་ དེ་ མི་ འདོད །_། |#| སངས་རྒྱས་ ཆོས་ རྣམས་ དེ་དག་ བསྟེན །_།
en: Without ever hankering for non-Dharma, They will rely upon the Dharma of the buddhas.

source: སེམས་ཅན་ རྣམས་ ཀྱི་ སོམ་ཉི་ གཅོད །_། དེ་ ནི་ ཆོས་ ཀྱི་ སྣང་བ་ བྱེད །_།
en: $970 “Resolving the doubts of beings, They will spread the light of the Dharma.

source: རྣལ་འབྱོར་ ཚུལ་ དུ་ སྲོག་ཆགས་ ཀྱི །_། ཁམས་ ནི་ དེ་ ཡིས་ རྣམ་པར་ སྦྱོང་ །_།
en: Engaging in the ways of spiritual practice, They will purify the dispositions of beings.

source: དེ་ ནི་ ལམ་ངན་ སྟོན་ མི་ བྱེད །_། |#| དྲང་པོ འང་ རབ་ཏུ་ སྟོན་པ ར་ བྱེད །_།
en: $971 “They will not teach the wrong path, But the correct one.

source: !སངས་རྒྱས་ ཆོས་ ལ་ དེས་པ་ ཡིས །_། ཆོས་ ཀྱི་ མཆོག་ གིས་ སྤྱོད་པ ར་ འགྱུར །_།
en: With conviction#40 in the Dharma of the buddhas They will practice it by means of the supreme of dharmas—

source: དེ་ ནི་ སེམས་ ལ་ རྟེན་པ་ མེད །_། |#| དེ་ ཡི་ གནས་ ནི་ ཡོད་ མ་ ཡིན །_།
en: $972 “That is, mind is devoid of basis, And lacks any foundation.

source: རྟེན་པ་ མེད་པ འི་ སེམས་ ཀྱིས་ སུ །_། བྱང་ཆུབ་ སྤྱོད་པ་ སྤྱོད་པ ར་ བྱེད །_།
en: By means of the mind devoid of basis, They will practice the conduct of bodhisattvas.

source: ཡུལ་འཁོར་ གྲོང་ དུ་ སྤྱོད་ བྱེད་ ཀྱང་ །_། གནས་ ནི་ ཡོད་པ་ མ་ ཡིན་ ཏེ །_།
en: $973 “Even as they course through villages of the land, Their mind does not abide—

source: རྟག་ ཏུ་ རྟེན་པ་ མེད་པར་ འགྱུར །_། |#| དེ་ ཡི་ གནས་ ནི་ ཡོད་ མ་ ཡིན །_།
en: It will always lack any basis, And not have any foundation.

source: འདུ་བྱེད་ རྣམས་ ཀྱིས་ འདོད་པ་ མིན །_།
en: $974 “It is not craved by formations.
